Revit 2026 API
IFCCategoryTemplate.SetMappingInfo Method
Overload List
Name | Description
SetMappingInfo(IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo>)
SetMappingInfo(ExportIFCCategoryKey, ExportIFCCategoryInfo) |  Set the mapping info for the key.
Top
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace